app/admin/dashboard.rb

SELECT "estoques".* FROM "estoques" WHERE (status = 0 and estoque_saldo < estoque_reposicao and estoque_reposicao > 0) ORDER BY tipo asc, grupo_id asc, descricao asc
---
    columns do
      column do
        panel "Solicitação de Compras" do
          table_for Estoque.order("tipo asc, grupo_id asc, descricao asc").where("status = 0 and estoque_saldo < estoque_reposicao and estoque_reposicao > 0") do

SELECT COUNT(*) FROM "estoques" WHERE (status = 0 and estoque_saldo < estoque_reposicao and estoque_reposicao > 0)
---

          tr :class => "odd" do
            td "Itens:", :style => "text-align: right;"
            td Estoque.where("status = 0 and estoque_saldo < estoque_reposicao and estoque_reposicao > 0").count()

SELECT SUM("estoques"."estoque_reposicao") FROM "estoques" WHERE (status = 0 and estoque_saldo < estoque_reposicao and estoque_reposicao > 0)
---

          tr :class => "odd" do
            td "Reposição:", :style => "text-align: right;"
            td number_with_precision Estoque.where("status = 0 and estoque_saldo < estoque_reposicao and estoque_reposicao > 0").sum(:estoque_reposicao), precision: 4

SELECT SUM("estoques"."custo_total") FROM "estoques" WHERE (status = 0 and estoque_saldo < estoque_reposicao and estoque_reposicao > 0)
---

          tr :class => "odd" do
            td "Custo:", :style => "text-align: right;"
            td number_to_currency Estoque.where("status = 0 and estoque_saldo < estoque_reposicao and estoque_reposicao > 0").sum(:custo_total)