app/admin/estoques.rb


  show title: :descricao do
    panel "Entradas" do
      table_for (estoque.entradas.order("data desc, documento, numero")) do
---
SELECT "entradas".* FROM "entradas" WHERE "entradas"."estoque_id" = ? ORDER BY data desc, documento, numero  [["estoque_id", 1]]


      tr :class => "odd" do
        td "ITENS:", :style => "text-align: right;"
        td estoque.entradas.count()
---
SELECT COUNT(*) FROM "entradas" WHERE "entradas"."estoque_id" = ?  [["estoque_id", 1]]


      tr :class => "odd" do
        td "QUANTIDADE:", :style => "text-align: right;"
        td number_with_precision (estoque.entradas).sum(:quantidade), precision: 4
---
SELECT SUM("entradas"."quantidade") FROM "entradas" WHERE "entradas"."estoque_id" = ?  [["estoque_id", 1]]


      tr :class => "odd" do
        td "VALOR:", :style => "text-align: right;"
        td number_to_currency (estoque.entradas).sum(:preco_total)
---
SELECT SUM("entradas"."preco_total") FROM "entradas" WHERE "entradas"."estoque_id" = ?  [["estoque_id", 1]]

    end

    panel "Saídas" do
      table_for (estoque.requisicoes.where("tipo = 0").order("data desc, setor, numero")) do
---
SELECT "requisicoes".* FROM "requisicoes" WHERE "requisicoes"."estoque_id" = ? AND (tipo = 0) ORDER BY data desc, setor, numero  [["estoque_id", 1]]


      tr :class => "odd" do
        td "ITENS:", :style => "text-align: right;"
        td estoque.requisicoes.where("tipo = 0").count()
---
SELECT COUNT(*) FROM "requisicoes" WHERE "requisicoes"."estoque_id" = ? AND (tipo = 0)  [["estoque_id", 1]]


      tr :class => "odd" do
        td "QUANTIDADE:", :style => "text-align: right;"
        td number_with_precision (estoque.requisicoes).where("tipo = 0").sum(:quantidade), precision: 4
---
SELECT SUM("requisicoes"."quantidade") FROM "requisicoes" WHERE "requisicoes"."estoque_id" = ? AND (tipo = 0)  [["estoque_id", 1]]


      tr :class => "odd" do
        td "VALOR:", :style => "text-align: right;"
        td number_to_currency (estoque.requisicoes).where("tipo = 0").sum(:custo_total)
---
SELECT SUM("requisicoes"."custo_total") FROM "requisicoes" WHERE "requisicoes"."estoque_id" = ? AND (tipo = 0)  [["estoque_id", 1]]

    end

    panel "Devoluções" do
      table_for (estoque.requisicoes.where("tipo = 1").order("data desc, setor, numero")) do
---
SELECT "requisicoes".* FROM "requisicoes" WHERE "requisicoes"."estoque_id" = ? AND (tipo = 1) ORDER BY data desc, setor, numero  [["estoque_id", 1]]


      tr :class => "odd" do
        td "ITENS:", :style => "text-align: right;"
        td estoque.requisicoes.where("tipo = 1").count()
---
SELECT COUNT(*) FROM "requisicoes" WHERE "requisicoes"."estoque_id" = ? AND (tipo = 1)  [["estoque_id", 1]]


      tr :class => "odd" do
        td "QUANTIDADE:", :style => "text-align: right;"
        td number_with_precision (estoque.requisicoes).where("tipo = 1").sum(:quantidade), precision: 4
---
SELECT SUM("requisicoes"."quantidade") FROM "requisicoes" WHERE "requisicoes"."estoque_id" = ? AND (tipo = 1)  [["estoque_id", 1]]


      tr :class => "odd" do
        td "TOTAL:", :style => "text-align: right;"
        td number_to_currency (estoque.requisicoes).where("tipo = 1").sum(:custo_total)
---
SELECT SUM("requisicoes"."custo_total") FROM "requisicoes" WHERE "requisicoes"."estoque_id" = ? AND (tipo = 1)  [["estoque_id", 1]]