app/admin/grupos.rb


  show title: :nome do
    panel "Itens" do
      table_for(grupo.estoques.order("descricao").where("status = 0")) do
---
SELECT "estoques".* FROM "estoques" WHERE "estoques"."grupo_id" = ? AND (status = 0) ORDER BY descricao  [["grupo_id", 4]]


      tr :class => "odd" do
        td "Itens:", :style => "text-align: right;"
        td grupo.estoques.where("status = 0").count()
---
SELECT COUNT(*) FROM "estoques" WHERE "estoques"."grupo_id" = ? AND (status = 0)  [["grupo_id", 4]]


      tr :class => "odd" do
        td "Quantidade:", :style => "text-align: right;"
        td number_with_precision (grupo.estoques).where("status = 0").sum(:estoque_saldo), precision: 4
---
SELECT SUM("estoques"."estoque_saldo") FROM "estoques" WHERE "estoques"."grupo_id" = ? AND (status = 0)  [["grupo_id", 4]]


      tr :class => "odd" do
        td "Total:", :style => "text-align: right;"
        td number_to_currency grupo.estoques.where("status = 0").sum(:custo_total)
---
SELECT SUM("estoques"."custo_total") FROM "estoques" WHERE "estoques"."grupo_id" = ? AND (status = 0)  [["grupo_id", 4]]