app/models/entrada.rb

UPDATE "entradas" SET "preco_total" = ?, "updated_at" = ? WHERE "entradas"."id" = ?  [["preco_total", 67.05], ["updated_at", "2020-05-22 21:20:19.600446"], ["id", 1]]
UPDATE "estoques" SET "estoque_saldo" = ?, "custo_medio" = ?, "custo_total" = ?, "updated_at" = ? WHERE "estoques"."id" = ?  [["estoque_saldo", 45.0], ["custo_medio", 1.49], ["custo_total", 67.05], ["updated_at", "2020-05-22 21:20:19.602140"], ["id", 9]]
---
  def after_create_entrada
    preco_total = self.quantidade * self.preco_unitario
    self.update(preco_total: preco_total)
    custo_medio = (((self.estoque.estoque_saldo * self.preco_unitario) + (self.quantidade * self.preco_unitario)) / (self.estoque.estoque_saldo + self.quantidade))
    estoque_saldo = self.estoque.estoque_saldo + self.quantidade
    custo_total = estoque_saldo * custo_medio
    self.estoque.update(custo_medio: custo_medio, estoque_saldo: estoque_saldo, custo_total: custo_total)