app/models/requisicao.rb

  def after_create_requisicao
    if self.tipo == "Requisição"
      self.update(custo_medio: self.estoque.custo_medio, custo_total: (self.quantidade * self.estoque.custo_medio))
      estoque_saldo = self.estoque.estoque_saldo - self.quantidade
      custo_total = estoque_saldo * custo_medio
      self.estoque.update(estoque_saldo: estoque_saldo, custo_total: custo_total)
    elsif
      self.update(custo_medio: self.estoque.custo_medio, custo_total: (self.quantidade * self.estoque.custo_medio))
      estoque_saldo = self.estoque.estoque_saldo + self.quantidade
      custo_total = estoque_saldo * custo_medio
      self.estoque.update(estoque_saldo: estoque_saldo, custo_total: custo_total)
---
UPDATE "estoques" SET "estoque_saldo" = ?, "custo_total" = ?, "updated_at" = ? WHERE "estoques"."id" = ?  [["estoque_saldo", 75.0], ["custo_total", 209.25], ["updated_at", "2020-05-22 21:20:19.750097"], ["id", 1]]
UPDATE "estoques" SET "estoque_saldo" = ?, "custo_total" = ?, "updated_at" = ? WHERE "estoques"."id" = ?  [["estoque_saldo", 75.0], ["custo_total", 171.75], ["updated_at", "2020-05-22 21:20:19.829500"], ["id", 3]]